import * as React from 'react';
import Link from '@mui/material/Link';
import Typography from '@mui/material/Typography';
import Title from '@/components/Dashboard/Title';

const blogdata = [
    {
        id: 'B00',
        topic: 'วิเคราะห์ เนื้อเรื่อง ลักษณะต่างๆ chainsawman เล่ม 1',
        book: '',
        userId: '001',
        createAt: '2022-12-09',
        updateAt: '',
        tag: ['Discussion','review','chainsawman','popular manga'],
        article: "ในขณะที่ EP ต่อไปก็เดินเรื่องได้อย่างรวดเร็ว จนแทบไม่มีจังหวะให้พักหายใจ ทั้งซีซันก็อัดแน่นไปด้วยจุดหักมุม ความดราม่า ลุ้นระทึกและเลือดสาด แต่ก็ยังไม่ทิ้งเรื่องราวที่เป็นแก่น อันสะท้อนถึง ผู้คนชายขอบ ที่ต้องดิ้นรนทุกวิถีทาง กระทั่งยอมทำเรื่องน่าอับอายเพียงเพื่อหาเงินมาจุนเจือชีวิตและด้วยความที่เรื่องนี้อุดมไปด้วยการหักมุม นั่นทำให้เราไม่รู้เลยว่าข้างหน้าจะเกิดอะไรขึ้น บางตอนมีความสุขไม่ถึงนาที Skip ไปอีกฉากรอยยิ้มนั้นกลับพันกลายเป็นเลือด ซึ่งการที่อาจารย์ทัตสึกิ กล้าเชือดตัวละครเป็นผักเป็นปลาก็ทำให้เรื่องนี้ดูมีมิติและน่าติดตามมากขึ้น"
    },
    {
        id: 'B01',
        topic: 'วิเคราะห์ เนื้อเรื่อง ลักษณะต่างๆ chainsawman เล่ม 1',
        book: '',
        userId: '001',
        createAt: '2022-12-09',
        updateAt: '',
        tag: ['Discussion','review','chainsawman','popular manga'],
        article: "ในขณะที่ EP ต่อไปก็เดินเรื่องได้อย่างรวดเร็ว จนแทบไม่มีจังหวะให้พักหายใจ ทั้งซีซันก็อัดแน่นไปด้วยจุดหักมุม ความดราม่า ลุ้นระทึกและเลือดสาด แต่ก็ยังไม่ทิ้งเรื่องราวที่เป็นแก่น อันสะท้อนถึง ผู้คนชายขอบ ที่ต้องดิ้นรนทุกวิถีทาง กระทั่งยอมทำเรื่องน่าอับอายเพียงเพื่อหาเงินมาจุนเจือชีวิตและด้วยความที่เรื่องนี้อุดมไปด้วยการหักมุม นั่นทำให้เราไม่รู้เลยว่าข้างหน้าจะเกิดอะไรขึ้น บางตอนมีความสุขไม่ถึงนาที Skip ไปอีกฉากรอยยิ้มนั้นกลับพันกลายเป็นเลือด ซึ่งการที่อาจารย์ทัตสึกิ กล้าเชือดตัวละครเป็นผักเป็นปลาก็ทำให้เรื่องนี้ดูมีมิติและน่าติดตามมากขึ้น"
    },
    {
        id: 'B02',
        topic: 'วิเคราะห์ เนื้อเรื่อง ลักษณะต่างๆ chainsawman เล่ม 1',
        book: '',
        userId: '001',
        createAt: '2022-12-09',
        updateAt: '',
        tag: ['Discussion','review','chainsawman','popular manga'],
        article: "ในขณะที่ EP ต่อไปก็เดินเรื่องได้อย่างรวดเร็ว จนแทบไม่มีจังหวะให้พักหายใจ ทั้งซีซันก็อัดแน่นไปด้วยจุดหักมุม ความดราม่า ลุ้นระทึกและเลือดสาด แต่ก็ยังไม่ทิ้งเรื่องราวที่เป็นแก่น อันสะท้อนถึง ผู้คนชายขอบ ที่ต้องดิ้นรนทุกวิถีทาง กระทั่งยอมทำเรื่องน่าอับอายเพียงเพื่อหาเงินมาจุนเจือชีวิตและด้วยความที่เรื่องนี้อุดมไปด้วยการหักมุม นั่นทำให้เราไม่รู้เลยว่าข้างหน้าจะเกิดอะไรขึ้น บางตอนมีความสุขไม่ถึงนาที Skip ไปอีกฉากรอยยิ้มนั้นกลับพันกลายเป็นเลือด ซึ่งการที่อาจารย์ทัตสึกิ กล้าเชือดตัวละครเป็นผักเป็นปลาก็ทำให้เรื่องนี้ดูมีมิติและน่าติดตามมากขึ้น"
    },
    {
        id: 'B03',
        topic: 'วิเคราะห์ เนื้อเรื่อง ลักษณะต่างๆ chainsawman เล่ม 1',
        book: '',
        userId: '001',
        createAt: '2022-12-09',
        updateAt: '',
        tag: ['Discussion','review','chainsawman','popular manga'],
        article: "ในขณะที่ EP ต่อไปก็เดินเรื่องได้อย่างรวดเร็ว จนแทบไม่มีจังหวะให้พักหายใจ ทั้งซีซันก็อัดแน่นไปด้วยจุดหักมุม ความดราม่า ลุ้นระทึกและเลือดสาด แต่ก็ยังไม่ทิ้งเรื่องราวที่เป็นแก่น อันสะท้อนถึง ผู้คนชายขอบ ที่ต้องดิ้นรนทุกวิถีทาง กระทั่งยอมทำเรื่องน่าอับอายเพียงเพื่อหาเงินมาจุนเจือชีวิตและด้วยความที่เรื่องนี้อุดมไปด้วยการหักมุม นั่นทำให้เราไม่รู้เลยว่าข้างหน้าจะเกิดอะไรขึ้น บางตอนมีความสุขไม่ถึงนาที Skip ไปอีกฉากรอยยิ้มนั้นกลับพันกลายเป็นเลือด ซึ่งการที่อาจารย์ทัตสึกิ กล้าเชือดตัวละครเป็นผักเป็นปลาก็ทำให้เรื่องนี้ดูมีมิติและน่าติดตามมากขึ้น"
    },
    {
        id: 'B04',
        topic: 'วิเคราะห์ เนื้อเรื่อง ลักษณะต่างๆ chainsawman เล่ม 1',
        book: '',
        userId: '001',
        createAt: '2022-12-09',
        updateAt: '',
        tag: ['Discussion','review','chainsawman','popular manga'],
        article: "ในขณะที่ EP ต่อไปก็เดินเรื่องได้อย่างรวดเร็ว จนแทบไม่มีจังหวะให้พักหายใจ ทั้งซีซันก็อัดแน่นไปด้วยจุดหักมุม ความดราม่า ลุ้นระทึกและเลือดสาด แต่ก็ยังไม่ทิ้งเรื่องราวที่เป็นแก่น อันสะท้อนถึง ผู้คนชายขอบ ที่ต้องดิ้นรนทุกวิถีทาง กระทั่งยอมทำเรื่องน่าอับอายเพียงเพื่อหาเงินมาจุนเจือชีวิตและด้วยความที่เรื่องนี้อุดมไปด้วยการหักมุม นั่นทำให้เราไม่รู้เลยว่าข้างหน้าจะเกิดอะไรขึ้น บางตอนมีความสุขไม่ถึงนาที Skip ไปอีกฉากรอยยิ้มนั้นกลับพันกลายเป็นเลือด ซึ่งการที่อาจารย์ทัตสึกิ กล้าเชือดตัวละครเป็นผักเป็นปลาก็ทำให้เรื่องนี้ดูมีมิติและน่าติดตามมากขึ้น"
    },

];

function preventDefault(event) {
  event.preventDefault();
}

export default function Deposits() {
  return (
    <React.Fragment>
      <Title>all blogs</Title>
      <Typography component="p" variant="h4">
        {blogdata.length + "  blogs"}
      </Typography>
      <Typography color="text.secondary" sx={{ flex: 1 }}>
        on {new Date().toISOString().split('T')[0]}
      </Typography>
    </React.Fragment>
  );
}